In [1]:
import pandas as pd

* series ---- 1d array
* Data frame ----- 2d array(table format,row&col)

In [2]:
a=pd.Series([])
b=pd.Series([1,2,33,47,58,100])
c=pd.Series([45,89,20,30,44])
d=pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\91810\AppData\Local\Temp\ipykernel_19068\169746044.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [10]:
import pandas as pd

In [11]:
import numpy as np

In [12]:
n=np.array([1,2,3,40])

In [16]:
x =pd.Series(n)

In [17]:
x

0     1
1     2
2     3
3    40
dtype: int32

In [18]:
type(x)

pandas.core.series.Series

In [20]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [21]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [22]:
b[0]

1

In [23]:
b[4]

[12, 23]

In [24]:
b[2:7]

2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
dtype: object

In [25]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [32]:
d['d']

99

In [34]:
d['b':'e']

b    15
c    56
d    99
dtype: int64

In [36]:
s=pd.Series([12,34,45,14,43],index=['q','w','e','r','t'])

In [37]:
s

q    12
w    34
e    45
r    14
t    43
dtype: int64

In [44]:
s1=pd.Series([12,34,45,14,43],index=list('qwert'))

In [45]:
s1

q    12
w    34
e    45
r    14
t    43
dtype: int64

In [ ]:
s2=pd.Series([12,34,45,56,23],)

# Data frame

In [48]:
a=pd.DataFrame()
b=pd.DataFrame([1,22,3,4,55,5])

In [49]:
a

Empty DataFrame
Columns: []
Index: []

In [50]:
b

    0
0   1
1  22
2   3
3   4
4  55
5   5

In [51]:
c = pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [52]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [57]:
d = pd.DataFrame([[1,2,3,32,54],[11,32,54,22,33],[4,12,78,5,6],[44,45,78,55,66],[7,32,56,8,9],])

In [58]:
d

    0   1   2   3   4
0   1   2   3  32  54
1  11  32  54  22  33
2   4  12  78   5   6
3  44  45  78  55  66
4   7  32  56   8   9

In [59]:
d.head()# first five

    0   1   2   3   4
0   1   2   3  32  54
1  11  32  54  22  33
2   4  12  78   5   6
3  44  45  78  55  66
4   7  32  56   8   9

In [60]:
d.tail()# last five

    0   1   2   3   4
0   1   2   3  32  54
1  11  32  54  22  33
2   4  12  78   5   6
3  44  45  78  55  66
4   7  32  56   8   9

In [64]:
d = pd.DataFrame([[1,2,3,32,54],[11,32,54,22,33],[4,12,78,5],[45,78,55,66],[7,32,56,9]],columns=['colA','colB','colC','colD','colE'])

In [65]:
d

   colA  colB  colC  colD  colE
0     1     2     3    32  54.0
1    11    32    54    22  33.0
2     4    12    78     5   NaN
3    45    78    55    66   NaN
4     7    32    56     9   NaN

.p.p[.;[o,p,op.l[po,,lpp[.p.p[,pol,[.;[l,p,l.[;ld[['colA','colC']]